/*
123456789050987654321 7
 1
 53456789050987654321
 17
  4456789050987654321
 176
   256789050987654321
   ...
*/

#include <stdio.h>
#include <string.h>
#define MAXN 1001
 
int main(void) {
	char str[MAXN];    //A有1000位之多，只能转化成字符串。
	int B, Q, R, len, i;
	
	scanf("%s%d", str, &B);  
	len = strlen(str);    //获取输入的一串数字的长度。
	Q = ( str[0] - '0' ) / B;    //获取第一个数的商。
    /*长度只有1位 或 第一个数比被除数大，要先输出第一个数的商*/
	if ( len == 1 || (len > 1 && Q != 0) )	printf("%d", Q);
	R = ( str[0] - '0' ) % B;    //获取第一个数的余数。
    /*从第二个数开始到整个字符串结束，模拟手动除法*/
	for ( i = 1; i < len; i++ ) {
		Q = ( (R * 10) + str[i] - '0' ) / B;    //获取商是 (余数*10 + 下一个数) / B.
		printf("%d", Q);    //每获取一个商就输出一次。
		R = ( (R * 10) + str[i] - '0' ) % B;    //获取余数是 (余数*10 + 下一个数) % B. 
	}
	printf(" %d", R);    //输出最后的余数。
	
	return 0;
}
